andeedotnet/ESP32-S3-ETH-8DI-8RO-firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Increase main task stack for init sequence
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# Ethernet: W5500 SPI, no internal EMAC (ESP32-S3 has none)
CONFIG_ETH_USE_SPI_ETHERNET=y
CONFIG_ETHERNET_SPI_SUPPORT=y
CONFIG_ETHERNET_SPI_DEV0_W5500=y
CONFIG_ETHERNET_INTERNAL_SUPPORT=n
CONFIG_ETHERNET_SPI_HOST=1
CONFIG_ETHERNET_SPI_SCLK_GPIO=15
CONFIG_ETHERNET_SPI_MOSI_GPIO=13
CONFIG_ETHERNET_SPI_MISO_GPIO=14
CONFIG_ETHERNET_SPI_CLOCK_MHZ=20
CONFIG_ETHERNET_SPI_CS0_GPIO=16
CONFIG_ETHERNET_SPI_INT0_GPIO=12
CONFIG_ETHERNET_SPI_PHY_RST0_GPIO=-1
CONFIG_ETHERNET_SPI_PHY_ADDR0=1
CONFIG_ETHERNET_SPI_NUMBER=1

# WiFi
CONFIG_ESP_WIFI_ENABLED=y

# LwIP: room for dual network interfaces + HTTP server connections
CONFIG_LWIP_MAX_SOCKETS=10
CONFIG_LWIP_MAX_RAW_PCBS=4

# FreeRTOS 1 ms tick
CONFIG_FREERTOS_HZ=1000

# USB-C Serial/JTAG console (matches the Type-C port on the board)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# NVS — no encryption needed for this application
CONFIG_NVS_ENCRYPTION=n

# Bluetooth: this is an Ethernet/WiFi-only device — keep BT/BLE fully out of the
# image so the controller never claims RAM and cannot be enabled by accident.
CONFIG_BT_ENABLED=n

# WDT: 15s gives HTTP client (3s timeout) ample margin before watchdog trips.
# PANIC=y so a genuinely hung task reboots the board instead of only logging —
# preferred for a 24/7 unattended industrial controller.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15
CONFIG_ESP_TASK_WDT_PANIC=y

# Core dump to flash: capture a backtrace of any panic for post-mortem analysis
# in the field (read back with `idf.py coredump-info` / `coredump-debug`).
# Requires the `coredump` partition declared in partitions.csv.
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
